<?php
/**
 * Created by PhpStorm.
 * User: sau00
 * Date: 5/31/17
 * Time: 3:07 AM
 */

namespace app\controllers;


use app\components\AuthHandler;
use app\models\Categories;
use app\models\Cities;
use app\models\Items;
use app\modules\parsers\models\UtilsModel;
use yii\data\ActiveDataProvider;
use yii\filters\AccessControl;
use yii\filters\VerbFilter;
use yii\web\Controller;
use yii\web\UploadedFile;

class ProfileController extends Controller
{
    /**
     * @inheritdoc
     */
    public function behaviors()
    {
        return [
            'access' => [
                'class' => AccessControl::className(),
                'only' => ['index', 'add', 'edit', 'delete', 'info', 'login', 'auth'],
                'denyCallback' => function ($rule, $action) {
                    $this->redirect(['profile/login']);
                },
                'rules' => [
                    [
                        'allow' => true,
                        'actions' => ['login', 'auth'],
                        'roles' => ['?'],
                    ],
                    [
                        'allow' => true,
                        'actions' => ['index', 'add', 'edit', 'delete', 'info', 'login'],
                        'roles' => ['@'],
                    ],
                ],
            ]
        ];
    }

    /**
     * @inheritdoc
     */
    public function actions()
    {
        return [
            'error' => [
                'class' => 'yii\web\ErrorAction',
            ],
            'captcha' => [
                'class' => 'yii\captcha\CaptchaAction',
                'fixedVerifyCode' => YII_ENV_TEST ? 'testme' : null,
            ],
            'auth' => [
                'class' => 'yii\authclient\AuthAction',
                'successCallback' => [$this, 'onAuthSuccess'],
            ],
        ];
    }

    public function onAuthSuccess($client)
    {
        (new AuthHandler($client))->handle();
    }

    public function actionIndex()
    {
        $dataProvider = new ActiveDataProvider([
            'query' => Items::find()->where(['user_id' => \Yii::$app->user->identity->id]),
        ]);

        return $this->render('index', [
            'dataProvider' => $dataProvider,
        ]);
    }

    public function actionLogin()
    {
        if(\Yii::$app->user->isGuest)
            return $this->render('login');
        else
            $this->redirect(['profile/index']);
    }

    public function actionAdd()
    {
        $model = new Items();
        if ($model->load(\Yii::$app->request->post())) {

            $model->image_file = UploadedFile::getInstance($model, 'image_file');

            $model->alias = UtilsModel::rus2translit($model->title . '_' . time());
            $model->upload();
        } else {

            $categories = Categories::find()->all();
            $categories_list = [];

            foreach($categories as $key => $category) {

                if($category->parent_id == null) {
                    $categories_list[$category->id] = $category->name;
                }

                foreach($categories as $child_key => $child_category) {
                    if($child_category->parent_id == $category->id) {
                        $categories_list[$child_category->id] = ' — ' . $child_category->name;
                    }
                }
            }

            $cities = Cities::find()->all();
            $cities_list = [];
            foreach($cities as $city) {
                $cities_list[$city->id] = $city->name;
            }

            return $this->render('add', [
                'model' => $model,
                'categories' => $categories_list,
                'cities' => $cities_list
            ]);
        }
    }

    public function actionTest()
    {
        $cities = ['Абакан','Абинск','Адлер','Азов','Аксай','Алдан','Александров','Александровск','Александровск-Сахалинский','Алексеевка','Алексин','Алупка','Алушта','Альметьевск','Амурск','Анадырь','Анапа','Ангарск','Анжеро-Судженск','Анива','Анна','Апатиты','Апрелевка','Арзамас','Армавир','Армянск','Арсеньев','Артем','Артемовский','Архангельск','Асбест','Астрахань','Аткарск','Ачинск','Аша','Бабаево','Багаевская','Балабаново','Балаково','Балахна','Балашиха','Балашов','Барнаул','Батайск','Бахчисарай','Бебелево','Белая Калитва','Белгород','Белово','Белогорск','Белогорск','Белорецк','Белореченск','Бердск','Березники','Березовка','Березовский','Березовский','Береславка','Беслан','Бийск','Биробиджан','Бирск','Благовещенск','Бобров','Богданович','Богородск','Богучар','Бодайбо','Бологое','Большой Камень','Бор','Борисоглебск','Боровичи','Боровск','Братск','Бронницы','Брянск','Бузулук','Буйнакск','Бутурлиновка','Валуйки','Ванино','Великие Луки','Великий Новгород','Вельск','Верхний Уфалей','Верхняя Пышма','Верхняя Салда','Веселый','Вешенская','Вешки','Взморье','Видное','Вилючинск','Вихоревка','Владивосток','Владикавказ','Владимир','Внуково','Волгоград','Волгодонск','Волжск','Волжский','Вологда','Волоколамск','Волоконовка','Волосово','Волхов','Вольно-Надеждинское','Вольск','Воркута','Воронеж','Воскресенск','Воскресенское','Воткинск','Всеволожск','Выборг','Выкса','Вырица','Выселки','Вышний Волочек','Вязьма','Гаврилов-ям','Гагарин','Гай','Галенки','Гатчина','Геленджик','Георгиевск','Глазов','Голицыно','Горки-2','Горно-Алтайск','Горнозаводск','Городец','Городище','Гремячинск','Грозный','Грязовец','Губаха','Губкин','Гудермес','Гуково','Гулькевичи','Гусиноозерск','Гусь Хрустальный','Далматово','Дальнегорск','Дальнереченск','Дедовск','Демидово','Десногорск','Детчино','Джанкой','Дзержинск','Дзержинский','Дивногорск','Димитровград','Дмитров','Добрянка','Долгопрудный','Домодедово','Донецк','Дубна','Дубовка','Дубовое','Дудинка','Евпатория','Егорлыкская','Егорьевск','Ейск','Екатеринбург','Елабуга','Елань','Елец','Елизово','Еманжелинск','Ерофей-Павлович','Ессентуки','Ефремов','Железноводск','Железногорск','Железногорск','Железногорск-Илимский','Железнодорожный','Жигулевск','Жирновск','Жуковка','Жуковский','Забайкальск','Заволжье','Заполярный','Зарайск','Заречный','Заринск','Звенигород','Зеленогорск','Зеленоград','Зерноград','Зима','Зимовники','Златоуст','Иваново','Ивантеевка','Ижевск','Иланский','Иловля','Инкерман','Инта','Иркутск','Искитим','Истра','Ишимбай','Йошкар-Ола','Кавалерово','Кагальницкая','Казань','Казлук','Калач','Калач-на-дону','Калининград','Калтан','Калуга','Калязин','Каменоломни','Каменск-Уральский','Каменск-Шахтинский','Камень-Рыболов','Камышин','Канаш','Кандалакша','Каневская','Канск','Кантемировка','Карабаш','Карагай','Карповка','Касимов','Каспийск','Качалино','Качканар','Кашары','Кашира','Кемерово','Керчь','Кизел','Кизляр','Кимры','Кинешма','Киржач','Кириши','Киров','Кировград','Кирово-Чепецк','Кировск','Кировск','Кировский','Киселевск','Кисловодск','Климовск','Клин','Ковров','Когалым','Кодинск','Коломна','Кольчугино','Комсомольск-на-Амуре','Конаково','Кондопога','Константиновск','Копейск','Коркино','Королёв','Корсаков','Коряжма','Кострома','Котельники','Котельниково','Котлас','Котлубань','Котово','Котовск','Красноармейск','Красновишерск','Красногорск','Краснодар','Красное-на-Волге','Краснознаменск','Краснокаменск','Краснокамск','Красноперекопск','Краснослободск','Краснотурьинск','Красноуральск','Красноуфимск','Красноярск','Красный Октябрь','Красный Сулин','Красный Яр','Крымск','Кстово','Куанда','Кубинка','Кудымкар','Кузнецк','Кулебаки','Кумертау','Кунгур','Курагино','Курган','Курганинск','Куровское','Курск','Курчатов','Кушва','Кызыл','Кыштым','Лабытнанги','Лангепас','Лебедянь','Лениногорск','Ленинск','Ленинск-Кузнецкий','Ленск','Лермонтов','Лесной','Лесной Городок','Лесозаводск','Линево','Липецк','Лобня','Лосино-Петровский','Луга','Луховицы','Лучегорск','Лысково','Лысьва','Лыткарино','Люберцы','Магадан','Магнитогорск','Майкоп','Макарьев','Малаховка','Малоярославец','Мариинск','Маркс','Матвеев Курган','Махачкала','Медвежьегорск','Медвежьи Озёра','Медногорск','Междуреченск','Менделеево','Менделеевск','Миасс','Микунь','Миллерово','Мильково','Минеральные Воды','Минусинск','Мирный','Мирный','Михайловка','Михайловка','Михнево','Мичуринск','Могоча','Можайск','Мончегорск','Морозовск','Москва','Муравленко','Мурманск','Мурмаши','Муром','Мытищи','Мышкин','Набережные Челны','Навашино','Навля','Надым','Назрань','Нальчик','Наро-Фоминск','Нарьян-Мар','Нахабино','Находка','Невинномысск','Невьянск','Нерехта','Нерюнгри','Нефтегорск','Нефтекамск','Нефтеюганск','Нехаевский','Нея','Нижневартовск','Нижнекамск','Нижнеудинск','Нижний Архыз','Нижний Новгород','Нижний Тагил','Нижняя Салда','Нижняя Тура','Николаевск','Николаевск-на-Амуре','Новая Чара','Новоаннинский','Нововоронеж','Новокубанск','Новокузнецк','Новокуйбышевск','Новомичуринск','Новомосковск','Новониколаевский','Новороссийск','Новосибирск','Новотроицк','Новоуральск','Новочебоксарск','Новочеркасск','Новошахтинск','Новошахтинский','Новый Оскол','Новый Рогачик','Новый Ургал','Новый Уренгой','Ногинск','Норильск','Ноябрьск','Нытва','Обнинск','Одинцово','Озерск','Октябрьский','Октябрьский','Оленегорск','Оленье','Ольга','Омск','Орда','Орел','Оренбург','Орехово-Зуево','Орлов','Орловский','Орск','Оса','Отрадное','Очер','Павлово','Павловский Посад','Палласовка','Пенза','Первомайск','Первоуральск','Переславль-Залесский','Пермь','Песковатка','Песьянка','Петрозаводск','Петропавловск-Камчатский','Печора','Пикалево','Питкяранта','Подозёрский','Подольск','Покров','Покровка','Полевской','Поназырево','Поронайск','пос. Лесной','Посëлок Арчединского Лесхоза','Приморско-Ахтарск','Прокопьевск','Протвино','Прохоровка','Псков','Путилково','Пушкино','Пущино','Пыть-ях','Пятигорск','Радужный','Радужный','Рай','Раменское','Ревда','Ремонтное','Реутов','Родионово-Несветайская','Романовская','Рославль','Россошь','Ростов','Ростов-на-Дону','Рубцовск','Рудня','Руза','Румянцево','Рыбинск','Ряжск','Рязань','Саки','Салават','Салехард','Салым','Сальск','Самара','Санкт-Петербург','Саракташ','Саранск','Сарапул','Саратов','Саров','Сатка','Сафоново','Саяногорск','Светлогорск','Светлоград','Светлый','Светлый Яр','Свободный','Севастополь','Северобайкальск','Северодвинск','Северск','Сегежа','Селятино','Семенов','Семикаракорск','Сергач','Сергиев Посад','Серебряные Пруды','Серов','Серпухов','Сертолово','Сестрорецк','Сибай','Симферополь','Сковородино','Славянка','Славянск-на-Кубани','Смоленск','Снежинск','Собинка','Советская Гавань','Советский','Соликамск','Солнечногорск','Сортавала','Сосновоборск','Сосновый Бор','Сочи','Спасск-Дальний','Средняя Ахтуба','Ставрополь','Старая Купавна','Старая Полтавка','Старая Русса','Старый Крым','Старый Оскол','Стерлитамак','Стрежевой','Ступино','Суворов','Судак','Сургут','Сухой Лог','Сходня','Сызрань','Сыктывкар','Сысерть','Таганрог','Таганьково','Тайга','Тайшет','Таксимо','Тамбов','Тарасовский','Тарко-сале','Татищево','Таштагол','Тверь','Тейково','Темрюк','Терней','Тимашевск','Тихвин','Тихорецк','Тобольск','Тольятти','Томилино','Томск','Топки','Трехгорный','Троицк','Троицк','Трудовое','Туапсе','Туймазы','Тула','Тутаев','Тымовское','Тында','Тюмень','Увельский','Углич','Удомля','Улан-Удэ','Ульяновск','Унеча','Урай','Урень','Урюпинск','Усинск','Уссурийск','Усть-Илимск','Усть-Кинельский','Усть-Кут','Уфа','Ухта','Учалы','Феодосия','Фокино','Фролово','Фрязино','Хабаровск','Ханты-Мансийск','Хасавюрт','Хилок','Химки','Холмск','Хороль','Целина','Цимлянск','Чайковский','Чалтырь','Чамзинка','Чапаевск','Чебаркуль','Чебоксары','Чегдомын','Челябинск','Череповец','Черкесск','Черниговка','Черноголовка','Черногорск','Чернушка','Чернышевск','Черняховск','Чертково','Чехов','Чита','Чудово','Чусовой','Шадринск','Шарыпово','Шарья','Шатура','Шахты','Шахунья','Шебекино','Шекшема','Шелехов','Шерегеш','Шилка','Шимановск','Шумерля','Шумиха','Шуя','Щёлкино','Щелково','Щербинка','Электрогорск','Электросталь','Электроугли','Элиста','Энгельс','Юбилейный','Югорск','Южно-Сахалинск','Южноуральск','Юрга','Юрюзань','Ядрин','Яковлевка','Якутск','Якшанга','Ялта','Янаул','Ярославль','Ярцево','Ясный','Яхрома'];

        foreach($cities as $city) {
            $model = new Cities();
            $model->name = $city;
            $model->alias = strtolower(UtilsModel::rus2translit($city));
            $model->save();
        }
    }

    public function actionUpdate($id)
    {
        $model = $this->findModel($id);

        if ($model->load(\Yii::$app->request->post()) && $model->save()) {
            return $this->redirect(['view', 'id' => $model->id]);
        } else {


            $categories = Categories::find()->all();
            $categories_list = [];

            foreach($categories as $key => $category) {

                if($category->parent_id == null) {
                    $categories_list[$category->id] = $category->name;
                }

                foreach($categories as $child_key => $child_category) {
                    if($child_category->parent_id == $category->id) {
                        $categories_list[$child_category->id] = ' — ' . $child_category->name;
                    }
                }
            }

            $cities = Cities::find()->all();
            $cities_list = [];
            foreach($cities as $city) {
                $cities_list[$city->id] = $city->name;
            }

            return $this->render('add', [
                'model' => $model,
                'categories' => $categories_list,
                'cities' => $cities_list
            ]);
        }
    }

    public function actionDelete($id)
    {
        $this->findModel($id)->delete();

        return $this->redirect(['profile/index']);
    }

    protected function findModel($id)
    {
        if (($model = Items::findOne($id)) !== null) {
            return $model;
        } else {
            throw new NotFoundHttpException('The requested page does not exist.');
        }
    }

    public function actionView($id)
    {
        $item = $this->findModel($id);

        $category = Categories::findOne($item->category_id);
        $city = Cities::findOne($item->city_id);

        return $this->redirect(['/' . $city->alias . '/' . $category->alias . '/' . $item->alias]);
    }
}